
&НаКлиенте
Процедура ЗаполнитьДанными(Команда)
	ЗаполнитьДаннымиНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиНаСервере()
	
	// Очистим данные
	НаборЗаписей = РегистрыСведений.Титаник.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
	Макет = РегистрыСведений.Титаник.ПолучитьМакет("ТренировочныйНабор");
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Идентификатор = Число(Макет.Область(НомерСтроки, 1).Текст);
		Если ЗначениеЗаполнено(Макет.Область(НомерСтроки, 2).Текст) Тогда
			НоваяЗапись.Выживание = ?(Макет.Область(НомерСтроки, 2).Текст = "1", Перечисления.Выживание.Выжил, Перечисления.Выживание.НеВыжил);
		КонецЕсли;
		Если Макет.Область(НомерСтроки, 3).Текст = "1" Тогда
			НоваяЗапись.Класс = Перечисления.Класс.Первый;
		ИначеЕсли Макет.Область(НомерСтроки, 3).Текст = "2" Тогда
			НоваяЗапись.Класс = Перечисления.Класс.Второй;
		ИначеЕсли Макет.Область(НомерСтроки, 3).Текст = "3" Тогда
			НоваяЗапись.Класс = Перечисления.Класс.Третий;
		КонецЕсли;
		НоваяЗапись.Имя = Макет.Область(НомерСтроки, 4).Текст;
		Если Макет.Область(НомерСтроки, 5).Текст = "male" Тогда
			НоваяЗапись.Пол = Перечисления.Пол.М;	
		ИначеЕсли Макет.Область(НомерСтроки, 5).Текст = "female" Тогда
			НоваяЗапись.Пол = Перечисления.Пол.Ж;
		КонецЕсли;		
		Попытка
			НоваяЗапись.Возраст = Число(Макет.Область(НомерСтроки, 6).Текст);
		Исключение
		КонецПопытки;
		НоваяЗапись.КоличествоРодственниковВторогоПорядка = Число(Макет.Область(НомерСтроки, 7).Текст);
		НоваяЗапись.КоличествоРодственниковПервогоПорядка = Число(Макет.Область(НомерСтроки, 8).Текст);
		НоваяЗапись.НомерБилета = Макет.Область(НомерСтроки, 9).Текст;
		Попытка
			НоваяЗапись.Тариф = Число(Макет.Область(НомерСтроки, 10).Текст);
		Исключение
		КонецПопытки;
		НоваяЗапись.Каюта = Макет.Область(НомерСтроки, 11).Текст;
		Если Макет.Область(НомерСтроки, 12).Текст = "C" Тогда
			НоваяЗапись.ПортПосадки = Перечисления.ПортПосадки.Cherbourg;
		ИначеЕсли Макет.Область(НомерСтроки, 12).Текст = "Q" Тогда
			НоваяЗапись.ПортПосадки = Перечисления.ПортПосадки.Queenstown;
		ИначеЕсли Макет.Область(НомерСтроки, 12).Текст = "S" Тогда
			НоваяЗапись.ПортПосадки = Перечисления.ПортПосадки.Southampton;	
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать();
		
КонецПроцедуры
